# Задача: используя цикл запрашивайте у пользователя число пока оно не станет больше 0, но меньше 10.
# После того, как пользователь введет корректное число, возведите его в степерь 2 и выведите на экран.
# Например, пользователь вводит число 123, вы сообщаете ему, что число не верное,
# и сообщаете об диапазоне допустимых. И просите ввести заного.
# Допустим пользователь ввел 2, оно подходит, возводим в степень 2, и выводим 4

# user_input = int(input('Введите число: '))
# if user_input in range(0, 11):
#     print(user_input**2)
# else:
#     print('Введите число от 0 до 10')

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;

# a = int(input('Введите число 1: '))
# b = int(input('Введите число 2: '))
# print(a, b)
# a, b = b, a
# print(a, b)

# Создайте программу медицинская анкета, где вы запросите у пользователя такие данные, как имя, фамилию, возраст, и вес.
# И выведите результат согласно которому пациент в хорошем состоянии, если ему до 30 лет и вес от 50 и до 120 кг,
# Пациенту требуется начать вести правильный образ жизни, если ему более 30 и вес меньше 50 или больше 120 кг
# Пациенту требуется врачебный осмотр, если ему более 40 и вес менее 50 или больше 120 кг.
# Все остальные варианты вы можете обработать на ваш вкус и полет фантазии =)
# Формула не отражает реальной действительности и здесь используется только ради примера.

# Пример: Вася Пупкин, 29 год, вес 90 - хорошее состояние
# Пример: Вася Пупкин, 31 год, вес 121 - следует заняться собой
# Пример: Вася Пупкин, 31 год, вес 49 - следует заняться собой
# Пример: Вася Пупкин, 41 год, вес 121 - следует обратится к врачу!
# Пример: Вася Пупкин, 41 год, вес 49 - следует обратится к врачу!

print('Hi! How are you? I`m Dr Electron.')
name = input('Give me your name: ')
surname = input('And surname: ')
age = int(input('How old are you? '))
weight = int(input('And give me your weight: '))
print('Let me think for the moment...')
if age < 30 and weight > 50 and weight < 120:
    print('Dear, {0} {1}, You are okey!'.format(name, surname))
elif age > 30 and weight < 50 or weight > 120:
    print('Dear, {0} {1}, You must meet with my colleague, Mrs Kitty. She is so pretty and she can help you.'.format(name, surname))
elif age > 40 and weight < 50 or weight > 120:
    print('Dear, {0} {1}, You must meet with my colleague, Mrs Kitty. She is so pretty and she can help you.'.format(name, surname))
else:
    print('I`ll call to emergency!')