from builtins import int, print, list

__author__ = 'Ивлиев Петр Павлович'

# Задача-1: Дано произвольное целое число, вывести поочередно цифры исходного числа

X = list(input('Введите целое число '))
print(X)

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

A = int(input("Сколько будет 2*2? ")) #4
B = int(input("А 7*7? ")) #49
A = A + B
B = A - B
A = A - B
print(B,A)

# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"

key = int(input("Сообщите Ваш возраст:"))
if key >= 18:
    print("Доступ разрешен")
else:
    print('Извините, пользование данным ресурсом только с 18 лет')


