
__author__ = 'Ивлиев Петр Павлович'

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.

x = list(input("введите произвольное целое беззнаковое число "))
print(max(x))

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.

A = int(input("Сколько будет 2*2? ")) #4
B = int(input("А 7*7? ")) #49
A = A^B
B = A^B
A = A^B
print(B,A)

# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax2 + bx + c = 0.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math
# import math
# math.sqrt(4) - вычисляет корень числа 4

a = int(input("Коэффициент a = "))
b = int(input("Коэффициент b = "))
c = int(input("Коэффициент c = "))

D = ((b**2)-(4*a*c))
import math
print("Дискриминант: ", D)
if D > 0:
    x1 = (-b+math.sqrt(D))/2*a
    x2 = (-b-math.sqrt(D))/2*a
    print(x1, x2)
elif D == 0:
    x = (-b+math.sqrt(D))/2*a
else:
        print("Корней нет")


